app/Controllers/Admin/BerandaController.php

SELECT *
FROM `sliders`
SELECT *
FROM `cards`
SELECT *
FROM `popups`
---
    public function index()
    {
        $sliderModel = new SliderBerandaModel();
        $popupModel = new PopupBerandaModel();
        $cardModel = new CardBerandaModel();
        $calenderModel = new CalenderModel();

        $data = [
            'sliders' => $sliderModel->findAll(),
            'popups' => $popupModel->findAll(),
            'cards' => $cardModel->findAll(),
            'calenders' => $calenderModel->findAll(),
        ];

SELECT *
FROM `cards`
WHERE `cards`.`id` = '1'
---
    public function detail_pengumuman($id)
    {
        $cardModel = new CardBerandaModel();
        $data['announcement'] = $cardModel->find($id);