app/Controllers/Admin/HariLiburController.php

SELECT *
FROM `hari_libur`
WHERE `tanggal` = '2025-03-03'
AND `hari_libur`.`deleted_at` IS NULL
 LIMIT 1
---
    public function isHoliday()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Invalid request']);
        }

        $tanggal = $this->request->getPost('tanggal');

        if (!$tanggal) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Tanggal tidak diberikan']);
        }

        $holiday = $this->hariLiburModel->where('tanggal', $tanggal)->first();