app/Controllers/Admin/PenugasanController.php

SELECT *
FROM `pegawai`
WHERE `id` = '179'
AND `pegawai`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `unit_kerja`
WHERE `id` = '6'
 LIMIT 1
SELECT *
FROM `unit_kerja`
WHERE `id` = '2'
AND `parent_id` = 1
AND nama_unit_kerja NOT LIKE '%staf ahli bidang%'
---
    public function index()
    {
        $penugasanModel = new PenugasanModel();
        $pegawaiModel = new PegawaiModel();
        $unitKerjaModel = new UnitKerjaModel();

        $pegawai_id = session()->get('pegawai_id');
        $role = session()->get('role_id');

        // Get logged in employee data
        $data_pegawai = $pegawaiModel->where('id', $pegawai_id)->first();
        if (!$data_pegawai) {
            return redirect()->to('/login')->with('error', 'Data pegawai tidak ditemukan.');
        }

        // Get unit data based on role
        if ($role == 1 || $role == 2) {
            // Admin dan Kepala Unit dapat melihat semua unit eselon 1
            $unit_eselon_1 = $unitKerjaModel->where('parent_id', 1)
                ->where("nama_unit_kerja NOT LIKE '%staf ahli bidang%'", null, false)
                ->findAll();
        } else if ($role == 3) {
            // Koordinator can only view their own eselon 1 unit
            $unit_pegawai = $unitKerjaModel->where('id', $data_pegawai['unit_kerja_id'])->first();
            if ($unit_pegawai) {
                $unit_eselon_1 = $unitKerjaModel
                    ->where('id', $unit_pegawai['parent_id'])
                    ->where('parent_id', 1)
                    ->where("nama_unit_kerja NOT LIKE '%staf ahli bidang%'", null, false)
                    ->findAll();

SELECT `usulan`.*, `pegawai`.`nama` as `nama_pengusul`, `unit_kerja`.`nama_unit_kerja` as `nama_unit`, `unit_kerja`.`id` as `unit_kerja_id`, `parent_unit`.`id` as `parent_unit_id`, `parent_unit`.`nama_unit_kerja` as `parent_unit_name`
FROM `usulan`
JOIN `pegawai` ON `pegawai`.`id` = `usulan`.`upload_by`
JOIN `unit_kerja` ON `unit_kerja`.`id` = `pegawai`.`unit_kerja_id`
JOIN `unit_kerja` as `parent_unit` ON `unit_kerja`.`parent_id` = `parent_unit`.`id`
WHERE `usulan`.`status_approval` = 1
AND `parent_unit`.`id` IN ('2')
AND `usulan`.`deleted_at` IS NULL
ORDER BY `usulan`.`created_at` DESC
---
        if (!empty($unit_eselon_1)) {
            $unitIds = array_column($unit_eselon_1, 'id');

            $newProposals = $penugasanModel
                ->select('usulan.*, pegawai.nama as nama_pengusul, unit_kerja.nama_unit_kerja as nama_unit,unit_kerja.id as unit_kerja_id, parent_unit.id as parent_unit_id, parent_unit.nama_unit_kerja as parent_unit_name')
                ->join('pegawai', 'pegawai.id = usulan.upload_by')
                ->join('unit_kerja', 'unit_kerja.id = pegawai.unit_kerja_id')
                ->join('unit_kerja as parent_unit', 'unit_kerja.parent_id = parent_unit.id')
                ->where('usulan.status_approval', 1) // Only pending proposals
                ->whereIn('parent_unit.id', $unitIds) // Only from ES 1 units in the list
                ->orderBy('usulan.created_at', 'DESC') // Show newest first
                ->findAll();