app/Controllers/Admin/ReferensiController.php

SELECT *
FROM `contents`
SELECT *
FROM `categories`
---
    public function index()
    {
        $contentModel = new ContentModel();
        $categoryModel = new CategoryModel();
        $contents = $contentModel->findAll();
        $categories = $categoryModel->findAll();

SELECT *
FROM `categories`
---
    public function create()
    {
        $categoryModel = new CategoryModel();
        $data['categories'] = $categoryModel->findAll();