app/Controllers/AdminController.php

SELECT *
FROM `contents`
WHERE `parent_id` = 0
---
    public function create()
    {
        $contentModel = new ContentModel();
        $data['categories'] = $contentModel->where('parent_id', 0)->findAll();

DELETE FROM `contents`
WHERE `id` IN ('5')
---
    public function delete($id)
    {
        $contentModel = new ContentModel();
        $contentModel->delete($id);