app/Controllers/BaseController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '16'
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.
        $this->session = \Config\Services::session();

        // Pastikan pengguna sudah login
        if (!$this->session->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Ambil user_id dari session
        $userId = $this->session->get('id');
        if (!$userId) {
            log_message('error', 'User ID not found in session.');
            return redirect()->to('/login'); // Arahkan ke halaman login jika user_id tidak ditemukan
        }

        // Debugging: Periksa userId
        log_message('debug', 'User ID: ' . $userId);

        // Ambil data user dari database
        $userModel = new UserModel();
        $this->userData = $userModel->find($userId);