app/Controllers/DashboardController.php

    public function index()
    {
        $sliderModel = new SliderBerandaModel();
        $popupModel = new PopupBerandaModel();
        $cardModel = new CardBerandaModel();

        $data = [
            'sliders' => $sliderModel->findAll(),
            'popups' => $popupModel->findAll(),
            'cards' => $cardModel->findAll(),
        ];
---
SELECT *
FROM `popups`
SELECT *
FROM `cards`
SELECT *
FROM `sliders`