app/Controllers/DashboardController.php

SELECT *
FROM `calenders`
SELECT *
FROM `hari_libur`
WHERE `hari_libur`.`deleted_at` IS NULL
---
    public function index()
{
    $sliderModel = new SliderBerandaModel();
    $popupModel = new PopupBerandaModel();
    $cardModel = new CardBerandaModel();
    $calenderModel = new CalenderModel();
    $hariLiburModel = new HariLiburModel();

    // Ambil 15 pengumuman terbaru
    $cards = $cardModel->getLatestAnnouncements(15);

    // Proses terjemahan tanggal pada setiap card
    foreach ($cards as &$card) {
        $card['translated_date'] = $this->translateDate($card['created_at']);
    }

    $calenders = $calenderModel->findAll();

    // Get holidays from hari_libur table
    $hariLibur = $hariLiburModel->findAll();

SELECT *
FROM `sliders`
SELECT *
FROM `popups`
---
        ];
    }

    $data = [
        'sliders' => $sliderModel->findAll(),
        'popups' => $popupModel->findAll(),
        'cards' => $cards,
        'role' => session()->get('role_id'),
        'calenders' => json_encode($formattedEvents),
    ];