app/Controllers/ReferensiController.php

    public function index()
    {
        $contentModel = new ContentModel();
        $categoryModel = new CategoryModel();
        $roleModel = new RoleModel();

        $contents = $contentModel->findAll();
        $categories = $categoryModel->findAll();
---
SELECT *
FROM `contents`
SELECT *
FROM `categories`