app/Models/CardBerandaModel.php

public function getLatestAnnouncements($limit = 15)
     {
         return $this->orderBy('created_at', 'DESC')->findAll($limit);
---
SELECT *
FROM `cards`
ORDER BY `created_at` DESC
 LIMIT 15