app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `id` = '4'
 LIMIT 1
---
    public function getUserById($id)
    {
        return $this->where('id', $id)->first();