app/Models/UserModel.php

SELECT `users`.*, `pegawai`.`nama` as `nama`, `pegawai`.`nip` as `nip`
FROM `users`
LEFT JOIN `pegawai` ON `users`.`pegawai_id` = `pegawai`.`id`
WHERE `users`.`id` = '4'
 LIMIT 1
---
    public function getAllUserWithNamaId($id)
    {
        return $this->select('users.*, pegawai.nama as nama, pegawai.nip as nip')
            ->join('pegawai', 'users.pegawai_id = pegawai.id', 'left')
            ->where('users.id', $id)
            ->first();